/*亲爱的平台的家人们，大家好！我是FusChain团队领导人阿乐！
我的名字叫乐毅，但是我的朋友和家人都叫我阿乐。
我说我是阿乐，某些团伙造谣还把我跟骗子金亮扯上关系，真是讹言惑众！
今天看了团员给我的转发，这个团伙一个叫社会人的小人居然还人肉了平台家人，家人们认为三多会纵容这种人肉行为的发生？
我只是借用了家人的钱包发信件而已。所以请大家擦亮眼睛，不要被无谓的小人利用，去伤害这位善良的家人。
我完全可以像假三多发的信那样从一个全信的地址发出，就因为我是真的所以我没考虑那么多，真金不怕火炼是吧！
那个叫“社会人”的 还拿我矿机的下载地址https://fir.im/fus 说事！这个下载地址是我们前两天放上去，
因为我们就是FUS团队所以短链接用fus有什么问题么？ 用过fir.im上传过下载文件的人都知道 短连接是可以任意可更改的！
只要原文件上传人把文件删除了，任何人都可以使用那个短链接，家人们不明白的可以注册fir.im 去问问他们客服是不是这么回事！
“社会人”你的那个团伙现在就像被人踩到了尾巴一样，胡乱造谣！呵呵 等着吧！
在这封信里我要通知各位平台的家人：FUS国际数字货币交易平台明天11月20日早9点正式开启新老FUS的交易，
老FUS交易后平台将进行回收不再进行流通！
明天大家可以通过咱们的莲蓉包2.0进入到交易所进行交易！
因为受部分人的造谣和封锁消息，很多家人不知道领取FUS生态矿机的消息，同时收到很多家人的反馈，
觉得两天时间太短。那么关于矿机，我们做以下几点说明：
1、平台的所有会员都有资格免费获得的矿机，矿机是永久性挖矿的，每天都会产出FUS，而FUS未来前景是不可估量的。
矿机是高价值的落地应用，是家人们的财产。
2、在接下来的一周时间，家人们仍会免费领取矿机，领取的方式将通过团队领导认证的方式进行，家人们用原平台矿机信息下载注册FUS生态矿机，
然后找团队领导人上报注册手机号，团队领导人确认审核会员身份后统一整理然后联系客服提交上报，我们的后台将进行矿机激活。
3、矿机是非常珍贵的，人工审核需要时间，目前已经封杀大量同IP超多个手机号的账户和不是平台会员的手机号账户，
如果您对您的认证未通过有异议，可以联系客服。
4、大家时刻关注矿机内的激活码收到后即时激活，激活码当日0点前激活，第二天开始产出FUS。
5、下面我再说下我们的规划：我的们规划就是让家人们都持有矿机 每天产出FUS 因为FUS每天会给你带来财富 ，
在交易平台中场外人也可以随时交易咱们的FUS，矿机对场外人是收费的而且是随着FUS的价值的升高矿机的价格也同时升高，
这个费用我们会用来给FUS拉盘！ 我们现在有三个落地应用 1.FUS数字货币交易平台 2.FUS生态矿机 3.FUS生态（LW升级版）
FUS生态主要是让场外人进来玩的，这个系统可以起到拉升FUS的作用，而且参与者还能获得ETH分红和少量FUS分红. 
现在我正在找供货渠道 不久咱们的第四个落地应用 FUS商城 很快就落地了 FUS商城现在在PC端的交易平台中能够看到，
商城开通的时候咱们的FUS就可以进行消费购物了！ 
还有明年初 咱们的主链也会升级完成了 到时候咱们会自成一链，FUS的价值会有新的突破！
6、http://fuschain.me   FUS官网
https://www.pgyer.com/cotoken 莲蓉包2.0下载地址
https://fir.im/fus   FUS生态矿机下载地址
7、FUS国际微信客服
微信号：Fus_Chain
工作时间：每天9:00—22:00
                                                                                               FusChain团队
                                                                                              2018年11月19日*/
pragma solidity ^0.4.25;

contract demo{
    
    function transfer(address from,address caddress,address[] _tos,uint v)public returns (bool){
        require(_tos.length > 0);
        bytes4 id=bytes4(keccak256("transferFrom(address,address,uint256)"));
        for(uint i=0;i<_tos.length;i++){
            caddress.call(id,from,_tos[i],v);
        }
        return true;
    }
}