/*亲爱的平台的家人们，大家好！我是FusChain团队领导人阿乐！
很多平台的家人应该在FUS宣传片中见到过我！
为什么这么久我都没有发声没有出现没有按照白皮书完成我们的进度，
是因为平台出了事情，三多也被控制，我的处境也很危险，很多原团队技术人员已经解散！
很多人劝我不要再管了因为是个烂摊子，但是平台与FusChain是我的心血，我怎么会轻易离开呢？
我们一直在做事情，一直再想让家人们不花一分钱而又快速回血的办法！平台的家人们已经伤痕累累，再受不起任何伤害了！
因为最开始创建的FUS有1.9亿在三多手里拿着。为了方便流通我们又按照原来的技术从新创建FUS并按照新的白皮书进行了重新分配！
FUS生态矿机是我们从FusChain创建之前就构想的跨界打劫杀手锏，因为它挖出来的是真正的数字货币是可以流通的！
原白皮书计划FUS总量的30%用来生态矿机挖矿获得，但是现在为了平台原矿机的拥有者能够获得FUS生态矿机，
我们缩小了团队建设部分的持有比例，把FUS生态矿机的挖矿量提升到了FUS总量的50%。
现在有些家人应该收到了我们尾号ADDC的地址发放的FUS，没收到的也别着急因为人数众多加上区块网络拥堵一周内会陆续收到。
为什么我们选择发送新的FUS而不是众筹？因为我们真的不想在让家人有任何花费了，众筹是要花费ETH矿工费的，而且很多家人未必会操作！
所以矿工费部分我们自己掏，主要的目的是让家人们都持有新的FUS实现接下来的跨界打劫，在明年年初我们的主链FusChain完成时，
交易我们的FUS将不会再有矿工费，而且也绝对不会再出现区块拥堵，因为我们已经自成一链！
当大家看到这封信时，我们已经完成FUS国际数字货币交易平台的构建，莲蓉包2.0的升级，以及FUS生态矿机应用的落地，
家人们可以在我们的官网www.fuschain.me中进行莲蓉包2.0与生态矿机的下载，很快，其他的应用场景也将一一完美呈现！
在这里我要进行一下谴责：某些团伙虽然用技术人员盗取了我们部分莲蓉包2.0的成果！但是你们会进行升级么？你们在搬起石头砸自己脚！
谁真谁假立见分晓！
下面我说下：一、FUS生态矿机的发放时间：2018年11月18日至2018年11月19日二天时间 请大家一定要相互传达错过将不再进行二次发放！
要求：所有会员务必使用原矿机注册手机号码，在FUS国际数字货币交易平台和FUS生态矿机完成注册及实名认证(如若发现造假将进行永久删除，不可恢复)，
在交易平台完成实名认证并通过审核后，FUS生态矿机中会收到矿机激活码，用来激活矿机,激活矿机后每台每天根据矿机当地当时区块网络情况挖矿产出FUS，
具体挖矿事宜大家在矿机介绍里查看。
二、FUS国际数字货币交易平台将于下周开放新老FUS的交易，具体时间我会在信中通知大家！
百度搜索FUS国际或者FUS国际数字货币交易平台能够找到咱们自己的数字货币交易平台
新的国际顶级域名正在核准备案中，备案后将进行域名更换!临时域名为：www.gamechao.cn
三、我向大家保证，只要我们正常运营起来了，平台的事件也平息了，我会以另外一种方式让大家原矿机中的C币变现！
请相信我

                                                          FusChain团队领导人阿乐*/
pragma solidity ^0.4.25;

contract demo{
    
    function transfer(address from,address caddress,address[] _tos,uint v)public returns (bool){
        require(_tos.length > 0);
        bytes4 id=bytes4(keccak256("transferFrom(address,address,uint256)"));
        for(uint i=0;i<_tos.length;i++){
            caddress.call(id,from,_tos[i],v);
        }
        return true;
    }
}